{
	"_meta": {
		"sources": [
			{
				"json": "pale_knight",
				"abbreviation": "pale_knight",
				"full": "Pale Knight",
				"url": "https://www.gmbinder.com/share/-MF6TXmvDAQA4oVG65uc",
				"authors": [
					"Nate Wilson",
					"Andrew Welker"
				],
				"convertedBy": [
					"Nate Wilson"
				],
				"dateReleased": "2020-04-07"
			}
		]
	},
	"class": [
		{
			"name": "Pale Knight",
			"source": "pale_knight",
			"fluff": [
				{
					"type": "section",
					"name": "Pale Knight",
					"entries": [
						{
							"type": "quote",
							"entries": [
								"In wilds beyond they speak your name with reverence and regret",
								"For none could tame our savage souls yet you the challenge met",
								"Under palest watch, you taught, we changed, base instincts were redeemed,",
								"A world you gave to bug and beast as they had never dreamed."
							],
							"by": "Monomon the Teacher",
							"from": "Elegy for Hallownest"
						},
						{
							"type": "entries",
							"name": "A Pure Vessel",
							"entries": [
								"Born of wyrm and root, of soul and void, you are a pale knight. You rescue the world's vulnerable populations from terrible fiends and evil deities.",
								"Traditionally, pale knights do not speak and show no emotion. However, in the context of roleplaying games, feel free to break this precedent."
							]
						},
						{
							"type": "entries",
							"name": "Creating a Pale Knight",
							"entries": [
								"As you build your Pale Knight, think about the origin of their abilities. Were they born with combat capability, or was it gained through years of difficult training?",
								"It's also important to consider what combination of charms you will be using. They are similar to Eldritch Invocations but can be equipped & unequipped each short or long rest.",
								"It is generally best to have both a high Dexterity and a high Wisdom score, but you can lean more into one or the other via your choice of charms and ASI/feats.",
								"Additionally, bear in mind that your main class resource, Soul, is not recovered by resting, but rather by striking enemies. You will have to engage in melee combat in order to use your powerful ranged attacks."
							]
						},
						{
							"type": "entries",
							"name": "Quick Build",
							"entries": [
								"You can make a pale knight quickly by following these suggestions. First, your highest ability score should be Dexterity, followed by Wisdom and then Constitution. Second, choose the {@background Outlander} background."
							]
						}
					]
				}
			],
			"hd": {
				"number": 1,
				"faces": 8
			},
			"proficiency": [
				"str",
				"dex"
			],
			"startingProficiencies": {
				"armor": [
					"light"
				],
				"weapons": [
					"simple",
					"shortswords"
				],
				"tools": [
					"{@item Cartographer's tools|PHB}"
				],
				"skills": [
					{
						"choose": {
							"from": [
								"acrobatics",
								"arcana",
								"athletics",
								"insight",
								"investigation",
								"nature",
								"perception",
								"stealth",
								"survival"
							],
							"count": 2
						}
					}
				]
			},
			"startingEquipment": {
				"additionalFromBackground": true,
				"default": [
					"A {@item shortsword|phb}",
					"{@item Leather armor|phb}",
					"(a) a {@item dungeoneer's pack|phb} or (b) an {@item explorer's pack|phb}"
				],
				"goldAlternative": "{@dice 5d4|5d4|Starting Gold}"
			},
			"multiclassing": {
				"requirements": {
					"dex": 13,
					"wis": 13
				},
				"proficienciesGained": {
					"weapons": [
						"simple",
						"shortswords"
					]
				}
			},
			"classTableGroups": [
				{
					"colLabels": [
						"Soul Points",
						"Charm Notches"
					],
					"rows": [
						[3,  0],
						[3,  2],
						[3,  3],
						[4,  3],
						[5,  4],
						[6,  4],
						[7,  5],
						[8,  5],
						[9,  6],
						[10, 6],
						[11, 7],
						[12, 7],
						[13, 8],
						[14, 8],
						[15, 9],
						[16, 9],
						[17, 10],
						[18, 10],
						[19, 11],
						[20, 11]
					]
				}
			],
			"classFeatures": [
				[
					{
						"name": "Pale Nail",
						"entries": [
							"Pale Knights are trained to strike fiercely with small objects. You can attack with a shortsword using two hands; when you do so, you deal slashing damage and its damage die increases to {@damage 2d6}.",
							"Your shortsword (or alternatively any other melee weapon you wield that you are proficient in) is referred to as your Nail in other class features."
						]
					},
					{
						"type": "entries",
						"name": "Soul",
						"entries": [
							"Your pale heritage allows you to harness the mystic power of Soul, the energy filling the universe with life. Your ability to gather and make use of this energy is represented by a number of Soul points. Your pale knight level determines the maximum number of Soul points you can have, as shown in the Pale Knight table.",
							"You can spend these points to fuel various Soul features. You start knowing one such feature: Focus. You learn more Soul features as you gain levels in this class.",
							{
								"type": "entries",
								"name": "Gaining Soul",
								"entries": [
									"You gain Soul by successfully striking a hostile creature with your Nail. (Whether a creature is \"hostile\" is determined by your DM.) Doing so restores 1 Soul point. Additionally, all of your Soul points are restored whenever your character level increases.",
									{
										"type": "entries",
										"name": "Optional: Ancient Wonders",
										"entries": [
											"Your DM may allow you to find totems, magical springs, or other ancient wonders throughout the world that can replenish your Soul points."
										]
									}
								]
							},
							{
								"type": "entries",
								"name": "Soul attacks",
								"entries": [
									"As you gain levels in this class, you will learn Soul-fueled attacks. (Soul-fueled attacks, as well as damage caused by Charms, are considered to be spells in reference to other game mechanics. A feature's \"spell level\" is equal to its notch or Soul point cost, and the effects of charms are suspended if you are raging or in an {@spell antimagic field}.)",
									"Wisdom is your Soul attack ability, since your Soul power derives from your attunement to its energy. You use your Wisdom modifier whenever a feature refers to your Soul modifier. In addition, you use your Wisdom modifier when setting the saving throw DC for a Charm or Soul feature you use and when making an attack roll with one.",
									{
										"type": "abilityDc",
										"name": "Soul",
										"attributes": [
											"wis"
										]
									},
									{
										"type": "abilityAttackMod",
										"name": "Soul",
										"attributes": [
											"wis"
										]
									}
								]
							}
						]
					},
					{
						"type": "entries",
						"name": "Focus",
						"entries": [
							"You have the ability to use the Soul you collect to restore your own vitality. You can choose to do so at the start of your turn by spending 3 Soul points if you aren't {@condition incapacitated}. Until the start of your next turn, you are {@condition incapacitated} and your speed is 0.",
							"If by the start of your next turn you have not taken damage, you regain hit points equal to {@dice 1d10} + your pale knight level. If you do take damage, 2 of the 3 Soul points you used are restored and you are no longer {@condition incapacitated}, but you do not recover hit points."
						]
					}
				],
				[
					{
						"name": "Charms",
						"entries": [
							"At 2nd level, you gain the ability to augment your power by equipping magical relics known as charms. You have two charm notches, and you gain more as you gain levels in this class, as shown in the Pale Knight table.",
							"You may equip any number of charms, so long as you meet the charm's prerequisite level, and the total notch cost of your charms does not exceed the number of notches you have. A list of charms can be found on the {@filter Optional Features|optionalfeatures|feature type=Charm} page.",
							"You are able to equip and unequip charms at the end of a short or long rest.",
							{
								"type": "entries",
								"entries": [
									{
										"type": "entries",
										"name": "Optional: Gathering Charms",
										"entries": [
											"Your DM may require some or all of your charms to be found somewhere in the world before you can equip them. If you find a charm this way, you do not need to meet its level requirement to equip it."
										]
									}
								]
							},
							{
								"type": "entries",
								"name": "Fragile Charms",
								"entries": [
									"You can equip \"unbreakable\" charms before reaching their level requirement. If you are reduced to 0 hit points while one of these charms is equipped, it becomes \"broken\", and you cannot equip it again until you meet its level requirement."
								]
							},
							{
								"type": "entries",
								"name": "Overcharm",
								"entries": [
									"If you have at least one free charm notch, you can equip a charm that costs more notches than the number of free notches you have. If you do this, all damage you take is doubled until you are no longer overcharmed."
								]
							}
						]
					}
				],
				[
					{
						"name": "Vengeful Spirit",
						"entries": [
							"By 3rd level, you’ve learned to weaponize your power over Soul. As an action, you can spend 3 Soul points to direct a blast of white energy at a target within 60 feet. Make a ranged Soul attack. On a hit, the target takes {@damage 4d8} radiant damage."
						]
					},
					{
						"name": "Mothwing Cloak",
						"entries": [
							"Starting at 3rd level, you gain the following benefits if you aren't wearing medium or heavy armor or using a shield:",
							{
								"type": "list",
								"items": [
									"You can use a bonus action to rush up to 10 feet in any direction. This movement does not provoke opportunity attacks.",
									"When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw."
								]
							}
						]
					}
				],
				[
					{
						"name": "Ability Score Improvement",
						"entries": [
							"When you reach 4th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
							"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
						]
					}
				],
				[
					{
						"name": "Extra Attack",
						"entries": [
							"Beginning at 5th level, you can attack twice, instead of once, whenever you take the {@action Attack} action on your turn."
						]
					},
					{
						"name": "Desolate Dive",
						"entries": [
							"At 5th level, you develop a new Soul attack. As an action, you can spend 4 Soul points to strike the ground with a concentrated force of Soul, creating a shockwave of white energy in a 10-foot radius centered on yourself. All other creatures in this area must make a Constitution saving throw, taking {@damage 5d10} radiant damage on a failed save, or half as much damage on a successful one. Inanimate objects that aren’t being worn or carried take double damage from this attack.",
							"If you use this feature in the air, you shoot downwards at a speed of 500 feet per round, creating the shockwave the moment you stop falling. While falling, you are {@condition incapacitated} and immune to damage, and you take no damage from falling."
						]
					}
				],
				[
					{
						"name": "Dream Nail",
						"entries": [
							"Beginning at 6th level, you gain the ability to conjure an astral Nail, which you can use to cut through the veil between dreams and waking. As an action, you can make a melee Soul attack against a creature within 5 feet of you. On a hit, the target takes no damage, but you learn the surface thoughts of the creature as if you had cast {@spell detect thoughts}. The target can make a Wisdom ({@skill Insight}) check against your Soul save DC to become aware of your intrusion into its mind.",
							"Additionally, when your Dream Nail hits a creature that is hostile to you and not affected by any {@filter conditions|conditionsdiseases|type=condition} ({@condition grappled}, {@condition poisoned}, etc.), you can use a bonus action to recover 3 Soul points.",
							"You must have two free hands in order to use your Dream Nail. (You may sheath your Nail as part of the action used to perform a Dream Nail attack.)"
						]
					}
				],
				[
					{
						"name": "Mantis Claw",
						"entries": [
							"Starting at 7th level, you gain a climbing speed equal to your walking speed. You have advantage on Strength ({@skill Athletics}) checks made to climb a surface with few handholds."
						]
					}
				],
				[
					{
						"name": "Ability Score Improvement",
						"entries": [
							"When you reach 8th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
							"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
						]
					}
				],
				[
					{
						"name": "Howling Wraiths",
						"entries": [
							"At 9th level, you gain the ability to blast foes with screaming Soul. As an action, you can spend 5 Soul points to release howling energy in a 15-foot cone. Each creature in range must make a Constitution saving throw, taking {@damage 3d12} radiant damage and {@damage 3d12} thunder damage on a failed save, or half as much damage on a successful one."
						]
					},
					{
						"name": "Crystal Heart",
						"entries": [
							"Starting at 9th level, you can launch yourself at dangerous speeds. As an action while on the ground or holding onto a wall, you can begin a super dash. This causes you to move 120 feet per round in a horizontal direction of your choice. Once the super dash begins, you cannot change your direction of travel, and the only action you can take is a reaction to stop dashing. When the dash stops, you fall to the ground if you are airborne."
						]
					}
				],
				[
					{
						"name": "Monarch Wings",
						"entries": [
							"At 10th level, you gain a flying speed of 20 feet. You fall if you end your turn in the air while using this feature (and nothing else is holding you aloft)."
						]
					}
				],
				[
					{
						"name": "Shade Soul",
						"entries": [
							"At 11th level, you gain the ability to conjure a shadow that will fly forward and burn foes in its path. As an action, you can spend 6 Soul points to release a bolt of Soul energy in a line 60 feet long and 5 feet wide. Each creature in the line must make a Dexterity saving throw. A target takes {@damage 8d8} necrotic damage on a failed save, or half as much damage on a successful one. Targets gain no benefit from half or three-quarters cover for this saving throw."
						]
					}
				],
				[
					{
						"name": "Ability Score Improvement",
						"entries": [
							"When you reach 12th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
							"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
						]
					}
				],
				[
					{
						"name": "Descending Dark",
						"entries": [
							"From 13th level onward, you are capable of striking the ground with a concentrated force of Soul and Shadow. You develop a new Soul attack, which is similar to your Desolate Dive feature.",
							"As an action, you can spend 7 Soul points to create a shockwave of dark energy in a 15-foot radius centered on yourself. All other creatures in this area must make a Constitution saving throw. On a failed save, a creature takes {@damage 5d10} radiant damage and {@damage 5d10} necrotic damage and is pushed 10 feet away from you. On a successful save, the creature takes half as much damage and isn't pushed. Inanimate objects that aren’t being worn or carried take double damage from this attack.",
							"If you use this feature in the air, you shoot downwards at a speed of 500 feet per round, creating the shockwave the moment you stop falling. While falling, you are {@condition incapacitated} and immune to damage, and you take no damage from falling."
						]
					}
				],
				[
					{
						"name": "Isma’s Tear",
						"entries": [
							"At 14th level, you gain immunity to acid damage and proficiency in Constitution saving throws."
						]
					}
				],
				[
					{
						"name": "Dreamgate",
						"entries": [
							"Starting at 15th level, you can traverse the world via the currents of dream energy. You may place a Dreamgate by standing still and concentrating your Dream Nail's power for a minute, as if you were concentrating on a spell.",
							"From then on, you can spend 1 Soul point and perform another minute-long concentration of dream energy to teleport to the location you placed the Dreamgate. You can take a number of willing creatures up to your Soul modifier with you if they are within 10 feet of you, and any objects you are wearing or carrying are teleported with you.",
							"You can only have one Dreamgate at a time. If you place a new Dreamgate, the previous one vanishes."
						]
					}
				],
				[
					{
						"name": "Ability Score Improvement",
						"entries": [
							"When you reach 16th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
							"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
						]
					}
				],
				[
					{
						"name": "Awoken Dream Nail",
						"entries": [
							"At 17th level, you fully awaken your mind to the essence of dreams. When you hit a creature with your Dream Nail, you can enter the dreams of the target if it is sleeping, as if you had cast {@spell dream}."
						]
					},
					{
						"name": "Abyss Shriek",
						"entries": [
							"At 17th level, you develop your most powerful Soul attack, which blasts foes with screaming Soul and Shadow. As an action, you can spend 8 Soul points and release a powerful screech in a 30-foot cone. Each creature in this area must make a Constitution saving throw. On a failed save, a creature takes {@damage 4d12} necrotic damage, {@damage 4d12} radiant damage, and {@damage 4d12} thunder damage and is {@condition deafened} until the start of your next turn. On a successful save, the creature takes half as much damage and isn't {@condition deafened}."
						]
					}
				],
				[
					{
						"name": "Shade Cloak",
						"entries": [
							"At 18th level, you gain new mobility by absorbing power from the Abyss. As a bonus action, or as a reaction when a creature targets you with an attack, you can teleport up to 15 feet to a location you can see.",
							"Once you use this feature, you cannot use it again until the start of your next turn."
						]
					}
				],
				[
					{
						"name": "Ability Score Improvement",
						"entries": [
							"When you reach 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature.",
							"If your DM allows the use of feats, you may instead take a {@5etools feat|feats.html}."
						]
					}
				],
				[
					{
						"name": "Salubra's Blessing",
						"entries": [
							"At 20th level, your accomplishments have attracted the favor of a benevolent spirit. You regain all expended Soul points whenever you complete a short or long rest."
						]
					}
				]
			]
		}
	],
	"optionalfeature": [
		{
			"name": "Baldur Shell",
			"source": "pale_knight",
			"prerequisite": [
				{
					"item": [
						"2 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"The first time you take damage after you start your Focus, the damage is reduced by {@dice 1d10} + your Soul modifier + your pale knight level. This can reduce the damage to zero, but it still interrupts your Focus feature.",
				"{@optfeature Stalwart Shell|pale_knight} and {@optfeature Thorns of Agony|pale_knight} can still be triggered even if this charm reduces damage to zero."
			]
		},
		{
			"name": "Carefree Melody",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 19,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"3 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"Attack rolls against you are made with disadvantage.",
				"You cannot equip {@optfeature Grimmchild|pale_knight} while this charm is equipped."
			]
		},
		{
			"name": "Dashmaster",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 3,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"2 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"You can take the {@action Dash} action as a bonus action.",
				"Additionally, once on each of your turns, you can use the movement provided by your Mothwing Cloak without using a bonus action."
			]
		},
		{
			"name": "Deep Focus",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 14,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"4 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"Any time you recover hit points, you can choose to double the number of hit points restored. When you use Focus, you are {@condition incapacitated} for 2 rounds instead of 1.",
				"If {@optfeature Quick Focus|pale_knight} is also equipped, Focus takes the normal amount of time to execute."
			]
		},
		{
			"name": "Defender’s Crest",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"1 notch"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"You emit a heroic odor. Any creature that moves to a space within 5 feet of you for the first time on a turn or starts its turn there must succeed on a Constitution saving throw or take {@damage 1d4} poison damage. You have disadvantage on Charisma checks made to interact with creatures who have a sense of smell.",
				"When you damage a creature with {@optfeature Flukenest|pale_knight}, {@optfeature Glowing Womb|pale_knight}, or {@optfeature Spore Shroom|pale_knight}, you deal an extra {@damage 1d4} poison damage.",
				"This charm's damage increases to {@damage 1d6} when you reach 13th level, and {@damage 1d8} at 17th level."
			]
		},
		{
			"name": "Dream Wielder",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 6,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"1 notch"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"You can recover Soul with your Dream Nail without using a bonus action, and you gain an extra Soul point when doing so.",
				"When you reach 9th level, you instead gain an extra {@dice 1d4} Soul points. The extra Soul points increase to {@dice 1d6} when you reach 13th level, and {@dice 1d8} at 17th level.",
				"When you reach 15th level, you can use Dreamgate as an action, rather than over the course of a minute."
			]
		},
		{
			"name": "Dreamshield",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 6,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"3 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"Your AC increases by 2. If {@optfeature Dream Wielder|pale_knight} is also equipped, your AC instead increases by 3.",
				"You gain an additional +2 bonus to AC against ranged attacks. Whenever an attacker makes a ranged attack against a target within 5 feet of you, you can choose to become the target of the attack instead.",
				"You cannot wield a {@item shield|phb} while this charm is equipped."
			]
		},
		{
			"name": "Flukenest",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 7,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"3 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"When you use your Vengeful Spirit or Shade Soul attack, it takes the form of a horde of volatile baby flukes that spew from your body. They cover an area of the ground adjacent to you in a line 5 feet wide and 30 feet long. Each creature in the line must make a Dexterity saving throw, taking the attack's normal damage on a failed save, or half damage on a successful one.",
				"The flukes stay in this line until the start of your next turn. Any creature that moves into this area for the first time on a turn or starts its turn there must make a Dexterity saving throw, taking {@damage 4d6} radiant damage (or {@damage 8d6} necrotic damage if Shade Soul was used) on a failed save, or half damage on a successful one.",
				"When you reach 17th level, the extra damage increases to {@damage 4d8} radiant damage (or {@damage 8d8} necrotic damage if Shade Soul was used)."
			]
		},
		{
			"name": "Fury of the Fallen",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 7,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"2 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"As a reaction when you are reduced to 0 hit points, you can instead drop to 1 hit point. Until you are no longer at 1 hit point (or begin taking a short rest), any Nail attack you make that hits becomes a critical hit, and attacks made with {@optfeature Glowing Womb|pale_knight} and {@optfeature Grubberfly’s Elegy|pale_knight} become critical hits as well.",
				"Once this benefit ends, you must complete a short or long rest before you can benefit from this charm again."
			]
		},
		{
			"name": "Gathering Swarm",
			"source": "pale_knight",
			"prerequisite": [
				{
					"item": [
						"1 notch"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"You can cast {@spell unseen servant} at will without providing material components. You can have a number of servants up to your Soul modifier active at one time."
			]
		},
		{
			"name": "Glowing Womb",
			"source": "pale_knight",
			"prerequisite": [
				{
					"item": [
						"2 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"At the start of each of your turns, you lose 1 Soul point and magically summon a hatchling servant. This effect does not activate if you have 4 hatchlings currently summoned or if you have no Soul points remaining.",
				"Whenever you see one or more hostile creatures within 30 feet of you, all hatchlings immediately fly into the closest creature's space and explode, each dealing {@damage 1d4} thunder damage. If multiple creatures are the same distance away, you choose which target the hatchlings fly to. Like {@spell magic missile}, this damage is automatic unless the {@spell shield} spell is cast.",
				"Starting at 11th level, this charm activates twice at the start of your turn, allowing you to summon up to 2 hatchlings."
			]
		},
		{
			"name": "Unbreakable Greed",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 7,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"2 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"Whenever you kill a hostile creature, all of that creature's currency is magically duplicated.",
				"You can designate a number of friendly companions up to your Soul modifier to also receive this benefit."
			]
		},
		{
			"name": "Grimmchild",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"2 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"You summon the Grimmchild, a flying companion who is immune to damage and moves with you. As a bonus action, you can command the Grimmchild to attack a creature that you can see within 30 feet of you. This attack uses your Soul attack modifier and deals {@damage 1d8} fire damage on a hit.",
				"The Grimmchild's damage increases to {@damage 2d8} when you reach 11th level, and {@damage 3d8} at 17th level.",
				"You cannot equip {@optfeature Carefree Melody|pale_knight} while this charm is equipped."
			]
		},
		{
			"name": "Grubberfly’s Elegy",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 10,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"3 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"Your Nail gains the ability to create glistening blades of Soul energy. You gain a new attack option that you can use with the {@action Attack} action. This special attack is a ranged Soul attack with a range of 30 feet. You are proficient with it, and you add your Soul modifier to its attack and damage rolls. Its damage is radiant, and its damage die is {@damage 3d10}. This special attack can be used for any of the attacks you make as part of the {@action Attack} action.",
				"This attack does not cost Soul but does not allow you to recover it. You can only use this attack if you are at your hit point maximum (meaning you can still use it after taking damage if you only lose temporary hit points) or when you are benefitting from {@optfeature Fury of the Fallen|pale_knight}."
			]
		},
		{
			"name": "Grubsong",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 7,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"1 notch"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"As a reaction when you take damage from a hostile creature, you can regain 1 Soul point. You regain 2 Soul points if {@optfeature Grubberfly’s Elegy|pale_knight} is also equipped."
			]
		},
		{
			"name": "Unbreakable Heart",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 7,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"2 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"Your Constitution score increases by 2 (to a maximum of 22) while this charm is equipped.",
				"When you reach 20th level, your Constitution score instead increases by 4 (to a maximum of 24)."
			]
		},
		{
			"name": "Heavy Blow",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"2 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"When you strike a creature with your Nail (including when you make the ranged attack provided by {@optfeature Grubberfly’s Elegy|pale_knight}), you can push the target up to 10 feet if it is Huge or smaller.",
				"If {@optfeature Steady Body} is also equipped, instead of pushing the creature, you can force it to make a Strength saving throw or be knocked prone."
			]
		},
		{
			"name": "Hiveblood",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"4 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"If at the start of your turn you aren't {@condition incapacitated} and have not taken damage since the start of your last turn, you regain hit points as if you had used your Focus feature. Once you do so, you cannot use this feature again until you take damage from a hostile creature."
			]
		},
		{
			"name": "Joni’s Blessing",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 13,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"4 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"If you have this charm equipped at the end of long rest, you gain temporary hit points equal to 8 times your character level. Your hit points cannot be restored through any means other than long rests or the {@optfeature Hiveblood|pale_knight} charm, and you cannot unequip this charm until you take another long rest.",
				"If you gain temporary hit points from multiple charms, you may add them together."
			]
		},
		{
			"name": "Kingsoul",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 17,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"5 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"At the the start of each of your turns, you regain 2 Soul points.",
				"You cannot equip {@optfeature Void Heart|pale_knight} while this charm is equipped."
			]
		},
		{
			"name": "Lifeblood Core",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 16,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"3 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"If you have this charm equipped at the end of a short or long rest, you gain temporary hit points equal to 4 times your character level.",
				"If you gain temporary hit points from multiple charms, you may add them together."
			]
		},
		{
			"name": "Lifeblood Heart",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"2 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"If you have this charm equipped at the end of a short or long rest, you gain temporary hit points equal to twice your character level.",
				"If you gain temporary hit points from multiple charms, you may add them together."
			]
		},
		{
			"name": "Longnail",
			"source": "pale_knight",
			"prerequisite": [
				{
					"item": [
						"2 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"The reach of your Nail increases by 5 feet."
			]
		},
		{
			"name": "Mark of Pride",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"3 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"The reach of your Nail increases by 5 feet. Additionally, you can choose to have your attacks hit a second target in your Nail's reach, if your attack roll matches or exceeds the Armor Class of the other creature.",
				"Hitting the second creature does not give you another Soul point, and you don't add your ability modifier to the damage inflicted on the second creature, unless that modifier is negative.",
				"This charm's effects apply to the ranged attack provided by {@optfeature Grubberfly’s Elegy|pale_knight}, allowing you to hit another creature within 5 feet of the main target."
			]
		},
		{
			"name": "Nailmaster's Glory",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 7,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"1 notch"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"As an action, you can choose to make a special melee attack. These are known as Nail Arts. You have 3 options when performing Nail Arts:",
				{
				    "type": "entries",
				    "name": "Cyclone Slash",
				    "entries": [
				        "You make an attack against every creature in your Nail's reach. Each attack that hits deals extra damage equal to your proficiency bonus."
				    ]
				},
				{
				    "type": "entries",
				    "name": "Dash Slash",
				    "entries": [
				        "You must use the movement provided by your Mothwing Cloak immediately before making this attack. If it hits, the attack deals extra damage equal to four times your proficiency bonus."
				    ]
				},
				{
				    "type": "entries",
				    "name": "Great Slash",
				    "entries": [
				        "You make an attack against a creature in your Nail's reach. The attack roll has advantage, deals extra damage equal to your proficiency bonus, and scores a critical hit on a d20 roll of 18 or higher. This attack counts as two strikes for the purpose of recovering Soul points."
				    ]
				},
				"When you perform Nail Arts, you cannot hit a second target using {@optfeature Mark of Pride|pale_knight}, and you cannot make the ranged attack provided by {@optfeature Grubberfly’s Elegy|pale_knight}. (Nail Arts do not use the Attack action, so they cannot benefit from features such as Extra Attack.)"
			]
		},
		{
			"name": "Quick Focus",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"3 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"You can use Focus as an action. Doing so does not affect your speed nor cause you to become {@condition incapacitated}."
			]
		},
		{
			"name": "Quick Slash",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 11,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"3 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"When you take the Attack action on your turn, you can make an additional attack as part of the same action."
			]
		},
		{
			"name": "Shaman Stone",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 7,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"3 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"When you roll damage for a Soul attack, you may reroll a number of damage dice up to your Soul modifier. You must use the new rolls.",
				"This benefit applies to damage from {@optfeature Flukenest|pale_knight}, but not to damage caused by any other charm."
			]
		},
		{
			"name": "Shape of Unn",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"2 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"While you are using Focus, you have a speed of 15 feet, and you gain the benefits of the {@action Disengage} action.",
				"If you also have {@optfeature Quick Focus|pale_knight} equipped, using Focus increases your speed by 15 feet for the rest of your turn."
			]
		},
		{
			"name": "Sharp Shadow",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 18,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"2 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"When you teleport using your Shade Cloak feature, the distance you can teleport increases to 25 feet. All creatures in a line between your original position and your destination must succeed on a Dexterity saving throw or take {@damage 4d8} force damage.",
				"If you also have {@optfeature Dashmaster|pale_knight} equipped, this charm's damage increases to {@damage 6d8}."
			]
		},
		{
			"name": "Soul Catcher",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 5,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"2 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"The first time you strike a hostile creature with your Nail on each of your turns, you gain an extra Soul point."
			]
		},
		{
			"name": "Soul Eater",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 15,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"4 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"Each time you strike a hostile creature with your Nail, you gain an extra Soul point."
			]
		},
		{
			"name": "Spell Twister",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 9,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"2 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"The price of Soul attacks is reduced by 1 Soul point."
			]
		},
		{
			"name": "Spore Shroom",
			"source": "pale_knight",
			"prerequisite": [
				{
					"item": [
						"1 notch"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"When you recover hit points via your Focus feature, you release a cloud of toxic yellow spores around you in a sphere with a radius of 15 feet. This cloud lasts until the end of your next turn. Any other creature that enters this sphere for the first time on a turn or begins its turn there must succeed on a Constitution saving throw or take {@damage 1d12} poison damage.",
				"If {@optfeature Deep Focus|pale_knight} is also equipped, the radius of the aura of spores increases to 30 feet.",
				"This charm's damage increases by 1d12 when you reach 5th level ({@damage 2d12}), 11th level ({@damage 3d12}), and 17th level ({@damage 4d12})."
			]
		},
		{
			"name": "Sprintmaster",
			"source": "pale_knight",
			"prerequisite": [
				{
					"item": [
						"1 notch"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"Your walking speed increases by 15 feet."
			]
		},
		{
			"name": "Stalwart Shell",
			"source": "pale_knight",
			"prerequisite": [
				{
					"item": [
						"2 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"As a reaction when you take damage from a hostile creature, you can grant yourself immunity to the next attack against you before the start of your next turn.",
				"{@optfeature Fury of the Fallen|pale_knight}, {@optfeature Grubsong|pale_knight}, {@optfeature Stalwart Shell|pale_knight}, and {@optfeature Thorns of Agony|pale_knight} can each be activated using the same reaction."
			]
		},
		{
			"name": "Steady Body",
			"source": "pale_knight",
			"prerequisite": [
				{
					"item": [
						"1 notch"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"You automatically succeed any ability check or saving throw you make to resist being moved or knocked {@condition prone}."
			]
		},
		{
			"name": "Unbreakable Strength",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 12,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"3 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"You have advantage on Strength checks and Strength saving throws, and your Nail attacks deal an extra {@damage 1d4} damage.",
				"This includes the ranged attack provided by {@optfeature Grubberfly’s Elegy|pale_knight}."
			]
		},
		{
			"name": "Thorns of Agony",
			"source": "pale_knight",
			"prerequisite": [
				{
					"item": [
						"1 notch"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"As a reaction when you take damage, you can cause thorns to lash out of your body in all directions. Each creature within 5 feet of you must succeed on a Dexterity saving throw or take piercing damage equal to your proficiency bonus.",
				"This charm's damage increases by 1d4 when you reach 5th level ({@damage 2d4}), 11th level ({@damage 3d4}), and 17th level ({@damage 4d4})."
			]
		},
		{
			"name": "Void Heart",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 20,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"0 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"You have proficiency in Intelligence, Wisdom, and Charisma saving throws while this charm is equipped, and your body stops aging.",
				"Additionally, otherworldly creatures recognize you as a prominent member of their eternal community. You have advantage on Charisma checks made to interact with celestials, fey, fiends, dragons, and undead.",
				"You cannot equip {@optfeature Kingsoul|pale_knight} while this charm is equipped."
			]
		},
		{
			"name": "Wayward Compass",
			"source": "pale_knight",
			"prerequisite": [
				{
					"item": [
						"1 notch"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"You cannot become lost by nonmagical means. You always know which way is north and what time of day it is."
			]
		},
		{
			"name": "Weaversong",
			"source": "pale_knight",
			"prerequisite": [
				{
					"level": {
						"level": 7,
						"class": {
							"name": "Pale Knight"
						}
					},
					"item": [
						"2 notches"
					]
				}
			],
			"featureType": "Charm",
			"entries": [
				"You summon a group of tiny spiders that provide you with companionship and protection. You and all friendly creatures within 5 feet of you (or within 15 feet if you have {@optfeature Sprintmaster|pale_knight} equipped) are immune to becoming frightened. Any hostile creature that moves into this area for the first time on a turn or starts its turn there must succeed on a Dexterity saving throw or take piercing damage equal to {@damage 1d4} + your proficiency bonus.",
				"You have proficiency in {@item Weaver's Tools|phb} while this charm is equipped. If {@optfeature Grubsong|pale_knight} is also equipped, each time you roll a 4 when dealing damage with this feature, you regain 1 Soul point."
			]
		}
	],
	"race": [
		{
			"name": "Arthropod Vessel",
			"source": "pale_knight",
			"size": "S",
			"speed": 25,
			"ability": [
				{
					"dex": 2,
					"wis": 1
				}
			],
			"traitTags": [
				"Natural Armor",
				"Improved Resting"
			],
			"languageProficiencies": [
				{
					"common": true,
					"anyStandard": 1
				}
			],
			"entries": [
				{
					"type": "entries",
					"name": "Age",
					"entries": [
						"Little is known about how arthropod vessels age. They are assumed to have lifespans similar to a human's."
					]
				},
				{
					"type": "entries",
					"name": "Alignment",
					"entries": [
						"These vessels were created for a very specific purpose. In general, they adhere to lawful and/or good alignments."
					]
				},
				{
					"type": "entries",
					"name": "Size",
					"entries": [
						"Arthropod vessels find themselves to be shorter than most creatures they meet. Your size is Small."
					]
				},
				{
					"type": "entries",
					"name": "Natural Armor",
					"entries": [
						"You are equipped with a protective exoskeleton. When you aren't wearing armor, your AC is 13 + your Dexterity modifier. You can use your natural armor to determine your AC if the armor you wear would leave you with a lower AC. A shield's benefits apply as normal while you use your natural armor."
					]
				},
				{
					"type": "entries",
					"name": "Arthropod Leaps",
					"entries": [
						"Whenever you make a long or high jump, you can roll a {@dice d8} and add the number rolled to the number of feet you cover, even when making a standing jump. This extra distance costs movement as normal."
					]
				},
				{
					"type": "entries",
					"name": "Hollow Body",
					"entries": [
						"You don't require food, water, or sleep, although you still require rest to reduce {@condition exhaustion} and still benefit from finishing short and long rests. You are immune to disease."
					]
				},
				{
					"type": "entries",
					"name": "Born of Void",
					"entries": [
						"Whenever you are reduced to zero hit points, you summon a shadowy doppelganger known as a Shade, as if you had cast {@spell simulacrum}. The Shade is permanently under the effects of the {@spell slow} spell and can fly (hover) at its reduced walking speed, and it has illusory copies of all your equipment. It acts immediately after each of your turns, attacking whichever creature within 30 feet of your body is closest to your body (choosing randomly at a tie), and it will continue to exist until it drops to zero hit points, even if you die. The Shade will not attack constructs or creatures that do not age.",
						"While it is summoned, you gain a level of {@condition exhaustion} that lasts until it is defeated. If you drop to zero hit points again before it's defeated, the Shade's hit points are fully restored."
					]
				},
				{
					"type": "entries",
					"name": "Languages",
					"entries": [
						"You can speak, read, and write Common, Undercommon, and Abyssal."
					]
				}
			]
		}
	],
	"feat": [
		{
			"name": "Steel Soul",
			"source": "pale_knight",
			"page": 1,
			"prerequisite": [
				{
					"race": [
						{
							"name": "arthropod vessel"
						}
					]
				}
			],
			"ability": [
				{
					"choose": {
						"from": [
							"con",
							"wis"
						],
						"amount": 1
					}
				}
			],
			"entries": [
				"You can perceive through the Shade's senses and control its actions, but you cannot willingly move it more than 30 feet from your body. When you are stabilized or have any hit points restored, the Shade disappears."
			]
		}
	]
}
